БИТУправление_медицинским_центром_демо/src/DataProcessors/invАРМПС2/invАРМПС2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>invАРМПС2</name>
  <tabularSections>
    <name>Option</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BiomaterialId</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>Типы контактной информации</comment>
  <enumValues>
    <name>Телефон</name>
    <comment>Телефон</comment>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
    <comment>Адрес</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>E-Mail</comment>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>Веб-страница</comment>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>Другая контактная информация (произвольная)</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/DataProcessors/invАРМПС2/Forms/ВыборСпособаУведомления/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьОформление(Команда)
	СписокЗначений = Новый СписокЗначений;
	Если ЗначениеЗаполнено(ЭлектроннаяПочта) Тогда
		СписокЗначений.Добавить(ЭлектроннаяПочта,"Email");
	КонецЕсли;
	Если ЗначениеЗаполнено(Телефон) Тогда
		СписокЗначений.Добавить(Телефон,"SmsNotification");
	КонецЕсли;
	//Если ЗначениеЗаполнено(СписокЗначений) Тогда
		Закрыть(СписокЗначений);
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Клиент = Параметры.Клиент;
	ЭлектроннаяПочта = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Клиент, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина);
	Телефон = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Клиент,Перечисления.ТипыКонтактнойИнформации.Телефон,,Истина);
КонецПроцедуры

#КонецОбласти
